In [2]:
# Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
pwd

'/Users/anna/Desktop/AIRMET_CASE_ECHO'

### DATABASES FROM BIG QUERY

### GOAL 2: DEFINE KEY DOCKING STATIONS FOR CAMPAIGN

#### 2.A.DEFINE STATIONS WITH HIGHER TOUCHPOINT VOLUME

In [61]:
# Let´s import the data - for Start Stations

start_stations = pd.read_csv('/Users/anna/Desktop/AIRMET_CASE_ECHO/data/start_date_start_station.csv')


# Let´s change the column names to a relavant names

start_stations.columns = ['date_day','start_station_id','count_rental_ids']
start_stations.head()

     date_day  start_station_id  count_rental_ids
0  2017-02-19             332.0                 4
1  2015-07-30             242.0                 6
2  2015-11-23              14.0                 4
3  2015-06-16             154.0                 4
4  2015-07-23             407.0                 5

In [62]:
# In order to not be extremely granular in our predicitons, and save some processing time,
# we will aggregate the data on a weekly basis

In [63]:
start_stations['date_day'] =  pd.to_datetime(start_stations['date_day'], format='%Y-%m-%d')

In [64]:
start_stations["Day_of_Week"] = start_stations['date_day'].dt.weekday

In [65]:
start_stations.head()

    date_day  start_station_id  count_rental_ids  Day_of_Week
0 2017-02-19             332.0                 4            6
1 2015-07-30             242.0                 6            3
2 2015-11-23              14.0                 4            0
3 2015-06-16             154.0                 4            1
4 2015-07-23             407.0                 5            3

In [66]:
from datetime import datetime, timedelta

In [67]:
start_stations["First_day_of_the_week"] = start_stations.apply(lambda x: x['date_day'] - timedelta(days=x['Day_of_Week']), axis=1)

In [68]:
# Let's first aggregate the dataset with start date, station_id and count of rentals
# by week

rentals_by_week_stations=start_stations.groupby(['start_station_id','First_day_of_the_week',]).sum()

In [69]:
# Let´s validate that stations have seasonality

In [70]:
rentals_by_week_stations =rentals_by_week_stations.drop(['Day_of_Week'],axis =1)

In [71]:
rentals_by_week_stations.head()

                                        count_rental_ids
start_station_id First_day_of_the_week
1.0              2014-12-29                            9
                 2015-01-05                          108
                 2015-01-12                          124
                 2015-01-19                          125
                 2015-01-26                          120

In [72]:
# let´s export the table to a csv
rentals_by_week_stations.to_csv(r'/Users/anna/Desktop/AIRMET_CASE_ECHO/tableau_data/rentals_by_week_stations.csv')

In [40]:
rentals_by_stations =rentals_by_week_stations.groupby(['start_station_id']).sum()

In [44]:
rentals_by_stations.sort_values('count_rental_ids').ascending=False

In [49]:
f_rentals_by_station = rentals_by_stations.sort_values(by=['count_rental_ids'], ascending=False)

In [52]:
# Let´s look at the TOP5 Stations by volume of rentals
f_rentals_by_station.head(5)

                  count_rental_ids
start_station_id
14.0                        232495
191.0                       213568
154.0                       199962
307.0                       160507
303.0                       153863

In [56]:
f_rentals_by_station.columns

Index(['count_rental_ids'], dtype='object')

In [73]:
# let´s export the table to a csv
rentals_by_week_stations.to_csv(r'/Users/anna/Desktop/AIRMET_CASE_ECHO/tableau_data/rentals_by_week_stations.csv')

In [6]:
# We will first add the initial 2 tables to understand volumes
# of touchpoints by stations (adding start & end station data)

In [7]:
# To do so, we will create a common field including date & station id

In [4]:
# Let´s import the data - for Start Stations

start_stations_2 = pd.read_csv('/Users/anna/Desktop/AIRMET_CASE_ECHO/data/start_date_start_station.csv')


# Let´s change the column names to a relavant names

start_stations_2.columns = ['date','station_id','count_rental_ids']
start_stations_2.head()

         date  station_id  count_rental_ids
0  2017-02-19       332.0                 4
1  2015-07-30       242.0                 6
2  2015-11-23        14.0                 4
3  2015-06-16       154.0                 4
4  2015-07-23       407.0                 5

In [5]:
start_stations_2['date'] =  pd.to_datetime(start_stations_2['date'], format='%Y-%m-%d')

In [6]:
july = start_stations_2['date'].map(lambda x: x.month)==7

In [7]:
aug = start_stations_2['date'].map(lambda x: x.month)==8

In [8]:
start_stations_july = start_stations_2[july]

In [9]:
start_stations_aug = start_stations_2[aug]

In [10]:
start_stations_peak = pd.concat([start_stations_july,start_stations_aug])

In [22]:
start_stations_peak.tail()

               date  station_id  count_rental_ids    date_str
21140628 2016-08-29       354.0                 3  2016-08-29
21140631 2016-08-13        10.0                 3  2016-08-13
21140633 2016-08-24       406.0                 3  2016-08-24
21140635 2016-08-28       785.0                 3  2016-08-28
21140639 2015-08-12       307.0                 3  2015-08-12

In [23]:
# Let´s import the data - for End Stations

end_stations_2 = pd.read_csv('/Users/anna/Desktop/AIRMET_CASE_ECHO/data/start_date_end_station.csv')


# Let´s change the column names to a relavant names

end_stations_2.columns = ['date','station_id','count_rental_ids']
end_stations_2.head()

         date  station_id  count_rental_ids
0  2016-11-17        14.0                 4
1  2016-03-27       407.0                 9
2  2016-12-25       191.0                 4
3  2017-02-18       376.0                 4
4  2016-01-28        14.0                 5

In [24]:
end_stations_2['date'] =  pd.to_datetime(end_stations_2['date'], format='%Y-%m-%d')

In [25]:
july_end = end_stations_2['date'].map(lambda x: x.month)==7

In [26]:
aug_end = end_stations_2['date'].map(lambda x: x.month)==8

In [27]:
end_stations_july = end_stations_2[july_end]

In [28]:
end_stations_aug = end_stations_2[aug_end]

In [29]:
end_stations_peak = pd.concat([end_stations_july,end_stations_aug])

In [30]:
end_stations_peak.tail()

               date  station_id  count_rental_ids
21231842 2016-08-04       225.0                 3
21231845 2015-08-08       584.0                 3
21231852 2016-08-17       154.0                 3
21231854 2015-08-22       404.0                 3
21231862 2016-08-28       191.0                 3

In [ ]:
# We will now need to create a common key to associate and join both tables

In [ ]:
# Let´s first convert date to string

In [31]:
start_stations_peak['date_str'] = start_stations_peak['date'].astype(str)

In [33]:
start_stations_peak['station_id'] = start_stations_peak['station_id'].astype(str)

In [34]:
start_stations_peak['date_station'] = start_stations_peak['date_str']+'_'+start_stations_peak['station_id']

In [35]:
start_stations_peak.head()

         date station_id  count_rental_ids    date_str      date_station
1  2015-07-30      242.0                 6  2015-07-30  2015-07-30_242.0
4  2015-07-23      407.0                 5  2015-07-23  2015-07-23_407.0
7  2015-07-28      154.0                 4  2015-07-28  2015-07-28_154.0
9  2015-07-25      462.0                 4  2015-07-25  2015-07-25_462.0
17 2016-07-10      553.0                 4  2016-07-10  2016-07-10_553.0

In [36]:
# Let´s now do it for the end_peak data

In [37]:
end_stations_peak['date_str'] = end_stations_peak['date'].astype(str)

In [38]:
end_stations_peak['station_id'] = end_stations_peak['station_id'].astype(str)

In [39]:
end_stations_peak['date_station'] = end_stations_peak['date_str']+'_'+end_stations_peak['station_id']

In [40]:
end_stations_peak.head()

         date station_id  count_rental_ids    date_str      date_station
10 2016-07-24      419.0                 4  2016-07-24  2016-07-24_419.0
13 2016-07-13      215.0                 4  2016-07-13  2016-07-13_215.0
26 2016-07-21       71.0                 4  2016-07-21   2016-07-21_71.0
41 2015-07-30      307.0                 4  2015-07-30  2015-07-30_307.0
48 2016-07-24      800.0                 4  2016-07-24  2016-07-24_800.0

In [ ]:
# We will now join both tables by the common key date_station

In [41]:
touchpoints_by_stations = pd.merge(start_stations_peak,end_stations_peak, on="date_station")

In [49]:
touchpoints_by_stations.tail()

,date_x,station_id_x,count_rental_ids_x,date_str_x,date_station,date_y,station_id_y,count_rental_ids_y,date_str_y
253842200,2016-08-26,608.0,2,2016-08-26,2016-08-26_608.0,2016-08-26,608.0,1,2016-08-26
253842201,2016-08-26,608.0,2,2016-08-26,2016-08-26_608.0,2016-08-26,608.0,1,2016-08-26
253842202,2016-08-26,608.0,2,2016-08-26,2016-08-26_608.0,2016-08-26,608.0,1,2016-08-26
253842203,2016-08-26,608.0,2,2016-08-26,2016-08-26_608.0,2016-08-26,608.0,1,2016-08-26
253842204,2016-08-26,608.0,2,2016-08-26,2016-08-26_608.0,2016-08-26,608.0,2,2016-08-26

In [51]:
touchpoints_by_stations_bydate = touchpoints_by_stations.drop(['date_str_x','date_station','date_y','date_str_y','station_id_y'],axis =1)

In [47]:
touchpoints_by_stations_bydate.tail()

,date_x,station_id_x,count_rental_ids_x,station_id_y,count_rental_ids_y
253842200,2016-08-26,608.0,2,608.0,1
253842201,2016-08-26,608.0,2,608.0,1
253842202,2016-08-26,608.0,2,608.0,1
253842203,2016-08-26,608.0,2,608.0,1
253842204,2016-08-26,608.0,2,608.0,2

In [52]:
touchpoints_by_stations_bydate['total_touchpoints'] = touchpoints_by_stations_bydate ['count_rental_ids_x']+touchpoints_by_stations_bydate ['count_rental_ids_y']

In [75]:
touchpoints_by_stations_bydate.tail()

,date_x,station_id_x,count_rental_ids_x,count_rental_ids_y,total_touchpoints
253842200,2016-08-26,608.0,2,1,3
253842201,2016-08-26,608.0,2,1,3
253842202,2016-08-26,608.0,2,1,3
253842203,2016-08-26,608.0,2,1,3
253842204,2016-08-26,608.0,2,2,4

In [79]:
print("There are", touchpoints_by_stations_bydate['date_x'].nunique(),"distinct dates in our dataset")

There are 124 distinct dates in our dataset

In [54]:
touchpoints_by_stations_f =touchpoints_by_stations_bydate.groupby(['station_id_x']).sum()

In [55]:
touchpoints_by_stations_f.head()

              count_rental_ids_x  count_rental_ids_y  total_touchpoints
station_id_x
1.0                        63392               63478             126870
10.0                      192466              191429             383895
100.0                     173146              169137             342283
101.0                    2079642             2070583            4150225
102.0                     266928              267072             534000

In [57]:
touchpoints_by_stations_f.sort_values(by=['total_touchpoints'], ascending=False)

              count_rental_ids_x  count_rental_ids_y  total_touchpoints
station_id_x
nan                     53405340            53405340          106810680
191.0                   13892304            14409523           28301827
303.0                    9529073             9678536           19207609
307.0                    8979267             9337855           18317122
14.0                     8139785             7445153           15584938
...                          ...                 ...                ...
502.0                       1829                1824               3653
555.0                       1606                1562               3168
346.0                         27                  27                 54
241.0                         10                  10                 20
778.0                          2                   2                  4

[790 rows x 3 columns]

In [59]:
# let´s export the table to a csv
touchpoints_by_stations_f.to_csv(r'/Users/anna/Desktop/AIRMET_CASE_ECHO/tableau_data/touchpoints_by_stations_f.csv')